Revit 2024 API
FamilyType Methods
The FamilyType type exposes the following members.
Methods
Name | Description
AsDouble
Provides access to the double precision number of the given family parameter.
AsElementId
Provides access to the Autodesk::Revit::DB::ElementId^ stored in the given family parameter.
AsInteger
Provides access to the integer number of the given family parameter.
AsString
Provides access to the string contents of the given family parameter.
AsValueString
Provides access to value as a string with unit in the given family parameter.
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasValue
Indicates if this family parameter has an assigned value or not.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FamilyType Class
Autodesk.Revit.DB Namespace